import React from 'react';
import { ContentOfPolicy, PolicyNav, PolycyContainer } from './Policy.styled';
import NavLinkComponent from '../../components/NavLinkComponent/NavLinkComponent';
import { RegisterTitle } from '../../components/RegisterForm/RegisterForm.styled';

const PrivacyPolicy = () => {
    return <PolycyContainer className="container" >
        <PolicyNav>
            <NavLinkComponent
                propTo="/"
                title ="Головна /"
            />
            <NavLinkComponent
                propTo="/privacy-policy"
                title ="Політика конфіденційності"
            />
        </PolicyNav>  

        <RegisterTitle>ПОЛІТИКА КОНФІДЕНЦІЙНОСТІ</RegisterTitle>

        <ContentOfPolicy>
            Ця Політика конфіденційності («Політика») охоплює питання збору, використання,
    розголошення, передачі та зберігання персональної інформації користувача.
        </ContentOfPolicy>
<ContentOfPolicy>
    Будь ласка, переконайтесь, що ви ознайомились із нашими правилами конфіденційності та
    зв`яжіться з нами, якщо y вас виникли запитання з цього приводу.
</ContentOfPolicy>
<ContentOfPolicy>
    Терміни, що використовуються y цій Політиці:
    
            </ContentOfPolicy>
            <ContentOfPolicy>
                • Персональні дані - будь-які відомості про фізичну особу, яка ідентифікована або може бути
    конкретно ідентифікована;
            </ContentOfPolicy>
<ContentOfPolicy>
    • Сyб`єкт персональних даних - ідентифікована чи така, що може бути ідентифікована
    фізична особа, персональні дані якої обробляються Власником персональних даних, який є
    відповідальним за обробку таких даних;
</ContentOfPolicy>
<ContentOfPolicy>
    • Обробка персональних даних - будь-яка дія або сукупність дій, котрі вчиняються по
    відношенню до персональних даних або сукупності персональних даних, такі як збирання,
    реєстрація, накопичення, структурування, зберігання, адаптування, зміна, поновлення,
    знеособлення, використання і поширення шляхом передачі, розповсюдження чи іншим
    способом, що робить такі дані доступними, комбінування, обмеження чи знищення
    персональних даних, у тому числі з використанням інформаційних (автоматизованих)
    систем;
</ContentOfPolicy>
<ContentOfPolicy>
    • Обмеження щодо обробки персональних даних - позначення персональних даних, що
    зберігаються, з метою обмеження їхньої обробки в майбутньому;
</ContentOfPolicy>
<ContentOfPolicy>
    • Власник персоньних даних - фізична або юридична особа, яка самостійно або спільно з
    іншими особами визначає мету обробки персональних даних, встановлює склад цих даних
    та процедури їх обробки;
</ContentOfPolicy>
<ContentOfPolicy>
    • Розпорядник персональних даних - фізична чи юридична особа, якій Власником
    персональних даних надано право обробляти ці дані від імені Власника;
</ContentOfPolicy>
<ContentOfPolicy>
    • Третя особа - будь-яка фізична або юридична особа, за винятком су`бєкта персональних
    даних, Власника чи Розпорядника персональних даних, якій Власником чи Розпорядником
    персональних даних здійснюється передача персональних даних та яка уповноважена
    здійснювати їх оробку;
</ContentOfPolicy>
<ContentOfPolicy>
    • Згода сyб`єкта персональних даних - добровільне волевиявлення фізичної особи щодо
    надання дозволу на обробку її персональних даних відповідно до сформульованої мети їх
    обробки, висловлене у формі, що дає змогу зробити висновок про надання згоди;
</ContentOfPolicy>
<ContentOfPolicy>
    • IP-адреса - ункальний ідентифікатор, який використовується певними електронними
    пристроями для ідентифікації та обміну даними один з одним в мережі Інтернет.</ContentOfPolicy>
    <ContentOfPolicy>Дані, що збираються або можуть збиратися Власником:</ContentOfPolicy>

<ContentOfPolicy>
    • контактні дані (ім`я, прізвище, посада, Компанія, номер телефону, адреса електронної
    пошти, посилання на особисті сторінки в соціальних мережах тощо);
</ContentOfPolicy>
<ContentOfPolicy>• фотографії, маеріали відео зйомки тощо.</ContentOfPolicy>
<ContentOfPolicy>
    Власник також може збирати дані, які містять інформацію про доменне ім`я або IP-адресу,
    дату та тривалість перебування Інтернет-користувача на сайтах компанії . Такі дані
    збираються автоматично, коли Інтернет-користувач відвідує сайти компанії. У поєднанні з
    іншими даними ця інформація допомагає Власнику дізнатися, який контент є найбільш
    привабливим для відвідувачів. Крім того, такі дані допомагають Власнику виявити
    дестабілізацію роботи обладнання.
</ContentOfPolicy>
<ContentOfPolicy>
    Веб-сайти використовують файли cookies, що являють собою невеликі текстові файли, які
    розміщені на пристрої користувача для зберігання даних і які може читати веб-сервер в домені,
    що розмістив їх. Власник використовує файли cookies для забезпечення можливості
    авторизації користувача на веб-сайтах компанії, аналізу роботи веб-сайтів, відстеження
    діяльності корисувачів на веб-сайтах, збору даних трафіку та для досягнення інших законних
    цілей.
</ContentOfPolicy>
<ContentOfPolicy>
    Більшість веб-браузерів автоматично використовують файли cookies, надаючи при цьому
    користувачам можливість керувати цим процесом шляхом їх блокування або видалення.
    Інструкції з блокування або видалення файлів cookies можна знайти в налаштуваннях
    конфіденційностіабо довідковій документації кожного веб-браузера.
</ContentOfPolicy>
<ContentOfPolicy>

    Компанія збирає ваші дані для таких цілей:
    
</ContentOfPolicy>
<ContentOfPolicy>• зв`язок з користувачем;</ContentOfPolicy>
<ContentOfPolicy>
    • направлення користувачу повідомлень, які містять інформацію про новини, заходи, події,
    які можуть бути цікавими для користувача;
</ContentOfPolicy>
<ContentOfPolicy>• надання відповідей на запити, питання та реагування на потреби користувача;</ContentOfPolicy>
<ContentOfPolicy>• проведення опиувань та досліджень;</ContentOfPolicy>
<ContentOfPolicy>• адміністрування членства та збір внесків на підтримку компанії;</ContentOfPolicy>
<ContentOfPolicy>• зберігання, оновлення та аналіз даних у корпоративному програмному забезпеченні;</ContentOfPolicy>
<ContentOfPolicy>
    • організація та реєстрація користувача на заходи, що проводяться компанія в рамках її
    статутної діяльності або до проведення яких долучається компанія;
</ContentOfPolicy>
<ContentOfPolicy>• використання користувачем веб-сайту компанії та його функціоналу;</ContentOfPolicy>
<ContentOfPolicy>
    • адміністрування веб-сайтів компанії, у тому числі покращення роботи Інтернет-сервісів
    компанії (розробка нових функцій та пропозицій тощо).
</ContentOfPolicy>
<ContentOfPolicy>
    Будь ласка, зверніть увагу, що, окрім перерахованих вище цілей, Власник також може
    обробляти персональні дані для надання правоохоронним органам інформації, яка є
    необхідною для кримінального провадження, або якщо така обробка є необхідною для
    виконання іншого законного обов`язку, з метою захисту життєво важливого інтересу як
    суб`єкта персональних даних або інтересу іншої фізичної особи, або захисту будь-яких інших
    законних інтересів компанії чи третьої особи, які не порушують основні права та свободи як
    суб`єкта персональних даних.
</ContentOfPolicy>
<ContentOfPolicy>
    Законний інтересозначає інтерес компанії в рамках здійснення її статутної діяльності. Коли
    Власник обробляє персональну інформацію в цілях, що відповідають його законним
    інтересам, він обов`язково збалансовує будь-який потенційний вплив на користувача та його
    права. Законні інтереси Власника автоматично не переважають над інтересами користувача.
</ContentOfPolicy>
<ContentOfPolicy>Власник обробляє персональні дані для конкретних законних цілей, серед яких, зокрема:</ContentOfPolicy>
<ContentOfPolicy>• зв`язок з користувачем;</ContentOfPolicy>
<ContentOfPolicy>
    • направлення користувачу електронних повідомлень, які містять інформацію про новини,
    заходи, події тощо, які можуть бути цікавими для користувача.
</ContentOfPolicy>
<ContentOfPolicy>
    Власник також може збирати дані, які не відносяться безпосередньо до конкретної людини
    (вони не є персональними даними). Власник може збирати, використовувати, передавати і
    розкривати такі відомості з будь-якою метою. При об`єднанн даних, що не є персональними,
    з персональними даними об`єднані дані будуть вважатися особистими, поки вони
    залишаються об`єднаними.
</ContentOfPolicy>
<ContentOfPolicy>
    Власник намагається полегшити для користувача процес відстеження точності, повноти та
    актуальності його персональних даних. Власник буде зберігати персональну інформацію
    протягом періоду, необхідного для виконання цілей, викладених y цій Політиці. Визначаючи
    тривалість таких періодів, Власник спочатку вирішує, чи потрібно йому збирати персональні
    дані взагалі, і,якщо така потреба дійсно існує, Власник зберігає їх лише на строк, необхідний
    для реалізації мети збору (наприклад, на строк трудових відносин з компанії тощо), за
    винятком випадків, коли закон встановлює більшу тривалість зберігання.
</ContentOfPolicy>
<ContentOfPolicy>
    Власник не надає персональні дані користувача організаціям чи особам за межами членської
    спільноти компанії, крім вказаних нижче випадків:
</ContentOfPolicy>
<ContentOfPolicy>
    • дані учасників подій, що організовуються компанія або до організації яких долучається
    компанія, можуть бути надані протокольним службам органів державної влади та
    місцевого самоврядування, адміністрації будівель, де відбувається захід для забезпечення
    вільного входу, спікерам (модераторам) заходів за їхньої усної чи письмової згоди.
</ContentOfPolicy>
<ContentOfPolicy>
    Лише імена, прізвища, електронні адреси, фотографії та посади учасників заходів, що
    організовуються компанією або до організації яких долучається компанія, членів керівних
    органів компанії співробітників компаній-членів компанії можуть бути опубліковані на вебсайті (веб-сайтах) компанії.
    Компанія дуже серйозно ставиться до захисту персональних даних користувача і пропагує їх
    захист. Власник захищає персональні дані різними способами з метою збереження
    конфіденційнсті та цілісності, запобігання несанкціонованому використанню або
    розголошенню персональних даних та захисту персональних даних користувача від втрати,
    неправильного використання, несанкціонованого доступу, розголошення, зміни та знищення.
</ContentOfPolicy>
<ContentOfPolicy>
    У кожного співробітника компанії є унікальний пароль для доступу до адміністративної
    частини веб-сайту, а також доступ до локальної бази даних.
</ContentOfPolicy>
<ContentOfPolicy>
    Хостинг-провайдери та оператори сервісів обміну файлами забезпечують захист за допомогою
    шифрування. Деякі типи даних, які зберігаються на сервісі обміну файлами, можуть бути
    обмежені у доступі для певної групи користувачів. Наприклад, співробітники одного відділу
    не можуть отримати доступ до даних інших відділів.
</ContentOfPolicy>
<ContentOfPolicy>
    Користувач має право на виправлення, видалення або доступ до своїх персональних даних,
    обмеження їхньоїобробки або заперечення щодо обробки своїх персональних даних. Якщо
    обробка здійснюється за згодою Користувача, він має право відкликати її в будь-який час.
</ContentOfPolicy>
<ContentOfPolicy>Для здійснення цих прав, будь ласка, зв`яжіться з компанією за адресою: mich_team@gmail.com</ContentOfPolicy>
<ContentOfPolicy>
    Інформація, яку Власник збирає, може бути передана, збережена та оброблена в будь-якій
    країні.
</ContentOfPolicy>
<ContentOfPolicy>
    Зокрема, Власник може передавати персональні дані сервісу розсилки електронних
    повідомлень, для розсилки інформаційних повідомлень, бюлетенів, запрошень, пропозицій
    тощо
</ContentOfPolicy>
<ContentOfPolicy>
    Власник також може надавати персональні дані своєму оператору сервісу обміну файлами, для
    забезпечення зберігання інформації, що на ньому знаходиться.
</ContentOfPolicy>
<ContentOfPolicy>
    Дані можуть передаватися також компанії Google LLC та/або Meta Platforms Inc. шляхом
    використання платформами файлів cookies. В даному випадку ці компанії виступають в якості
    розпорядника таких даних.
</ContentOfPolicy>
<ContentOfPolicy>
    Хоча інші теритоії можуть і не мати таких самих стандартів захисту персональних даних, як
    в межах країни Користувача, Власник буде захищати персональні дані, які передає, відповідно
    до положень цієї Політики.
</ContentOfPolicy>
<ContentOfPolicy>
    Компанія залишає за собою право вносити зміни в дану політику в односторонньому порядку,
                без попереднього повідомлення. Актуальна версія політики доступна на вебресурсі компанії.
</ContentOfPolicy>
        
    </PolycyContainer>
}

export default PrivacyPolicy;